app/views/articles/_article.html.erb


<% if article.categories.any? %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT 1  [["article_id", 18]]