app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)
		@article.user = User.first
		if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This is my first articlenbn"], ["description", ",n,,hj,lhj"], ["user_id", 6], ["created_at", "2017-04-18 12:37:50.939710"], ["updated_at", "2017-04-18 12:37:50.939710"]]

	def update
		if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "This is edit"], ["description", "This is the descriptionhhjhhjhhhthtt"], ["updated_at", "2017-04-15 12:10:35.066246"], ["id", 1]]