app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT 5 OFFSET 0  [["category_id", 1]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]
---
def show

@category = Category.find(params[:id])

@category_articles = @category.articles.paginate(page: params[:page], per_page: 5)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "wwe"], ["updated_at", "2017-04-19 11:09:07.376445"], ["id", 4]]
---
def update

@category = Category.find(params[:id])

if @category.update(category_params)