app/controllers/users_controller.rb

def update

if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$PGq5b.E2LQnvjNeiZHJkiuGd/hVhcbC/6kgDifUrQGtXPghdEDt5m"], ["updated_at", "2017-04-18 09:19:25.971514"], ["id", 1]]

def show

@user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT 5 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]