app/views/layouts/_navigation.html.erb


<% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"